# Beauty and the Labour Market

The aim of this assignment is to investigate the relationship between a person's physical attractiveness and their economic success.

## Research Question and Hypothesis:
This research questions if beauty influences a person's economic success''

Null Hypothesis H<sub>o</sub>:
Alternate Hypothesis H<sub>a</sub>:

## Data Description:

In [1]:
import pandas as pd

The dataset is loaded in and the variables are examined.

In [23]:
file_path = './beauty and the labor market.csv'
data = pd.read_csv(file_path)
data.head()

,wage,lwage,belavg,abvavg,exper,looks,union,goodhlth,black,female,married,south,bigcity,smllcity,service,expersq,educ,Nservice,Slooks
0,5.73,1.745715,0,1,30,4,0,1,0,1,1,0,0,1,1,900,14,0,4
1,4.28,1.453953,0,0,28,3,0,1,0,1,1,1,0,1,0,784,12,1,0
2,7.96,2.074429,0,1,35,4,0,1,0,1,0,0,0,1,0,1225,10,1,0
3,11.57,2.448416,0,0,38,3,0,1,0,0,1,0,1,0,1,1444,16,0,3
4,11.42,2.435366,0,0,27,3,0,1,0,0,1,0,0,1,0,729,16,1,0

 ### Data Source (from Assignment)
19xx Quality of American Life survey (QAL) contains interviews of 1260 respondents. The dataset contains usual labor-market and demographic variables of interest to economists. Most importantly, it contains information on the respondents’ look. In this survey, the interviewer, who visited the respondent in his or her abode, had to rate the respondent’s physical appearance on a five-point scale, along which looks rang from homely to strikingly handsome or beautiful. Because we are interested in investigating the relationship between one’s look and income. It is essential to have a dataset that have information on both productivity-enhancing characteristics (such as education level, working experiences, etc.) and one’s physical attractiveness level.  However, in the dataset, we do not have detailed information on the respondent’s occupation. The only information we know is that if the respondent is in service industry!

In [24]:
# getting an overview of our data
print("Our data has {0} rows and {1} columns".format(data.shape[0], data.shape[1]))

Our data has 1260 rows and 19 columns

The table below shows a statistical summary of the dataset. Women form only 35% of the population surveryed for this data. Wages are given as hourly wages (Hammermesh & Biddle 1994, 1179) and the highest wage earned in this dataset is 77.7/hour. The average hourly wage is 6.30. Further

In [25]:
data.describe()

,wage,lwage,belavg,abvavg,exper,looks,union,goodhlth,black,female,married,south,bigcity,smllcity,service,expersq,educ,Nservice,Slooks
count,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000
mean,6.306690,1.658800,0.123016,0.303968,18.206349,3.185714,0.272222,0.933333,0.073810,0.346032,0.691270,0.174603,0.219048,0.466667,0.273810,474.482540,12.563492,0.726190,0.875397
std,4.660639,0.594508,0.328586,0.460152,11.963485,0.684877,0.445280,0.249543,0.261564,0.475892,0.462153,0.379778,0.413765,0.499086,0.446089,534.645425,2.624489,0.446089,1.474010
min,1.020000,0.019803,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,5.000000,0.000000,0.000000
25%,3.707500,1.310357,0.000000,0.000000,8.000000,3.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,64.000000,12.000000,0.000000,0.000000
50%,5.300000,1.667705,0.000000,0.000000,15.000000,3.000000,0.000000,1.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,225.000000,12.000000,1.000000,0.000000
75%,7.695000,2.040570,0.000000,1.000000,27.000000,4.000000,1.000000,1.000000,0.000000,1.000000,1.000000,0.000000,0.000000,1.000000,1.000000,729.000000,13.000000,1.000000,2.000000
max,77.720001,4.353113,1.000000,1.000000,48.000000,5.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,2304.000000,17.000000,1.000000,5.000000

It is interesting to note that when the dataset is sorted in a descending order by `wage` and `looks`, the top six positions are all male with looks rated at 5 and with the highest wages. They are however not necessarily in the service industry.

In [9]:
data.sort_values(['looks', 'wage'],ascending=[False, False], inplace=True)
data.head(10)

,wage,lwage,belavg,abvavg,exper,looks,union,goodhlth,black,female,married,south,bigcity,smllcity,service,expersq,educ,Nservice,Slooks
76,23.32,3.149311,0,1,15,5,0,1,0,0,1,1,0,0,1,225,17,0,5
27,19.08,2.948641,0,1,17,5,0,1,0,0,0,0,1,0,0,289,17,1,0
26,14.84,2.697326,0,1,29,5,0,1,0,0,0,1,1,0,1,841,13,0,5
659,12.66,2.538447,0,1,22,5,1,1,0,0,1,1,1,0,0,484,12,1,0
363,10.66,2.366498,0,1,8,5,0,1,0,0,0,0,0,0,0,64,13,1,0
653,7.96,2.074429,0,1,15,5,0,1,0,0,1,0,0,1,0,225,12,1,0
112,6.11,1.809927,0,1,7,5,0,1,0,1,1,0,0,0,0,49,12,1,0
512,5.09,1.627278,0,1,7,5,0,1,0,1,0,0,1,0,0,49,17,1,0
562,4.95,1.599388,0,1,10,5,0,1,1,1,0,0,1,0,0,100,14,1,0
952,4.81,1.570697,0,1,6,5,0,1,0,0,1,0,0,0,0,36,16,1,0

In [29]:
wage_looks = pd.pivot_table(data, index= ['female','looks'], values= "wage")
wage_looks

                  wage
female looks
0      1      6.163750
       2      6.249091
       3      7.598957
       4      7.226447
       5      9.923636
1      1      2.154000
       2      3.829074
       3      4.207854
       4      4.745074
       5      3.902500